# LoadedFamilyIntegrityCheck Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadedFamilyIntegrityCheck Members
LoadedFamilyIntegrityCheck Class Methods See Also
---
The LoadedFamilyIntegrityCheck type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckAllFamilies | Check that all families loaded in the host document have their content documents. |
| CheckAllFamiliesSlow | Check integrity of content documents of all families loaded in the host document. |
| CheckFamily | Check that the loaded family has its content document. |

# See Also
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace